conf/src/InformationRegisters/ЭП_ЭффективностьСотрудников/ЭП_ЭффективностьСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ЭффективностьСотрудников</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ЭП_ПоказателиЭффективностиСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ПериодОценивания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрофильРасчета</name>
    <type>
      <types>CatalogRef.ЭП_ПрофилиРасчетаРезультативности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ЭП_ПоказателиЭффективностиСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/InformationRegisters/ЭП_ДатыЗакрытияРедактированияПоказателей/ЭП_ДатыЗакрытияРедактированияПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ДатыЗакрытияРедактированияПоказателей</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>РасчетныйПрофиль</name>
    <type>
      <types>CatalogRef.ЭП_ПрофилиРасчетаРезультативности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/InformationRegisters/ЭП_ЭффективностьСотрудников/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
	
		Возврат;		
	
	КонецЕсли;
	
	ТекРасчетныеПрофиля = ЭтотОбъект.ВыгрузитьКолонку("ПрофильРасчета");	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭП_ДатыЗакрытияРедактированияПоказателейСрезПоследних.РасчетныйПрофиль КАК РасчетныйПрофиль,
	               |	ЭП_ДатыЗакрытияРедактированияПоказателейСрезПоследних.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.ЭП_ДатыЗакрытияРедактированияПоказателей.СрезПоследних(&Период, РасчетныйПрофиль В (&МассивРасчетныхПрофилей)) КАК ЭП_ДатыЗакрытияРедактированияПоказателейСрезПоследних
	               |ГДЕ
	               |	ЭП_ДатыЗакрытияРедактированияПоказателейСрезПоследних.Период = &Период";
	Запрос.УстановитьПараметр("МассивРасчетныхПрофилей", ТекРасчетныеПрофиля); 
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Отбор.ПериодОценивания.Значение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
			
		Отказ = Истина;
		Выборка = РезультатЗапроса.Выбрать();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "По следующим расчетным профилям закрыт период редактирования: ";        
		Сообщение.Сообщить();
		Пока Выборка.Следующий() Цикл
		
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ""+Выборка.РасчетныйПрофиль;        
			Сообщение.Сообщить();
		
		КонецЦикла;
		Возврат;
	
	КонецЕсли;
	
КонецПроцедуры
